# PlanCircuitSetIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanCircuitSetIterator Class
Members See Also
---
An iterator to a set of plan circuit objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class PlanCircuitSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class PlanCircuitSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class PlanCircuitSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..PlanCircuitSetIterator
# See Also
PlanCircuitSetIterator Members
Autodesk.Revit.DB Namespace